package content.icons {
	/**
	 * Класс для удобной работы с данными об иконках
	 * @author 2Bob Анатолий Воеводин
	 */
	public class Icons {
		
		/** Количество иконок в игре */
		public static const COUNT:int = 5;
		
		public function Icons() {
			
		}
		
		//-------------------------------------EVENTS--------------------------------------
		
		//--------------------------------PRIVATE/PROTECTED--------------------------------
		
		//-------------------------------------PUBLIC--------------------------------------
		/** Получить случайный ID одной из всех иконок */
		public static function getRandomID():int {
			//зная общее кол-во иконок в игре, выбираем случайную
			return (Math.round(Math.random() * (COUNT - 1)) + 1);
		}
		
		//---------------------------------GETTERS/SETTERS---------------------------------
		
	}

}