package {
	/**
	 * ...
	 * @author 2Bob Анатолий Воеводин
	 */
	public class Settings {
		
		public static const BET:int = 10;
		
		public function Settings() {
			
		}
		
		//-------------------------------------EVENTS--------------------------------------
		
		//--------------------------------PRIVATE/PROTECTED--------------------------------
		
		//-------------------------------------PUBLIC--------------------------------------
		
		//---------------------------------GETTERS/SETTERS---------------------------------
		
	}

}